Revit 2024 API
ReferencePlane.FreeEnd Property
 The free end of the reference plane.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public XYZ FreeEnd { get; set; }
Visual Basic
Public Property FreeEnd As XYZ
	Get
	Set
Visual C++
public:
property XYZ^ FreeEnd {
	XYZ^ get ();
	void set (XYZ^ value);
}
Remarks
 When setting this property, an exception will be thrown if the free end is set to almost the same point as bubble end or if the vector from BubbleEnd -> FreeEnd is not perpendicular to the normal vector.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
ReferencePlane Class
Autodesk.Revit.DB Namespace